c5/src/Documents/Event/Event.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Event</name>
  <posting>Deny</posting>
  <attributes>
    <name>Color</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>How</name>
    <type>
      <types>EnumRef.Communications</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Reminder</name>
    <type>
      <types>EnumRef.Reminder</types>
    </type>
  </attributes>
  <attributes>
    <name>ReminderDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.EventStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Enums/EventStatuses/EventStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EventStatuses</name>
  <enumValues>
    <name>Scheduled</name>
  </enumValues>
  <enumValues>
    <name>Completed</name>
  </enumValues>
  <enumValues>
    <name>Cancelled</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Reminder/Reminder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Reminder</name>
  <enumValues>
    <name>None</name>
  </enumValues>
  <enumValues>
    <name>_5m</name>
  </enumValues>
  <enumValues>
    <name>_15m</name>
  </enumValues>
  <enumValues>
    <name>_30m</name>
  </enumValues>
  <enumValues>
    <name>_1h</name>
  </enumValues>
  <enumValues>
    <name>_1d</name>
  </enumValues>
  <enumValues>
    <name>_1w</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Event/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var IsNew;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkPeriod ()
		or not employeeAvailable () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkPeriod ()
	
	if ( not Periods.Ok ( Start, Finish ) ) then
		Output.PeriodError ( , "Finish" );
		return false;
	endif; 
	now = CurrentSessionDate ();
	if ( Start < now
		and Status = Enums.EventStatuses.Scheduled ) then
		Output.EventExpired ( , "Start" );
		return false;
	elsif ( Start > now
		and Status = Enums.EventStatuses.Completed ) then
		Output.EventNotStarted ( , "Start" );
		return false;
	endif; 
	return true;
	
EndFunction

Function employeeAvailable ()
	
	SetPrivilegedMode ( true );
	data = getConflict ();
	if ( data = undefined ) then
		return true;
	endif;
	event = data.Ref;
	Output.ResponsibleBusy ( new Structure ( "Responsible, Event", Responsible, event ), , event );
	return false;
	
EndFunction

Function getConflict ()
	
	s = "
	|// @Data
	|select top 1 Events.Ref as Ref
	|from Document.Event as Events
	|where Events.Ref <> &Ref
	|and not Events.DeletionMark
	|and Events.Responsible = &Responsible
	|and Events.Status = value ( Enum.EventStatuses.Scheduled )
	|and ( Events.Start between &Start and &Finish
	|	or Events.Finish between &Start and &Finish )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Responsible", Responsible );
	q.SetParameter ( "Start", Start );
	q.SetParameter ( "Finish", Finish );
	return SQL.Exec ( q ).Data;
	
EndFunction

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	IsNew = IsNew ();
	removeReminder ();
	if ( DataExchange.Load
		or DeletionMark ) then
		return;
	endif;
	setReminderDate ();
	
EndProcedure

Procedure removeReminder ()
	
	if ( IsNew ) then
		return;
	endif; 
	Jobs.Remove ( Ref );
	
EndProcedure 

Procedure setReminderDate ()
	
	if ( Reminder = Enums.Reminder.None ) then
		return;
	endif; 
	ReminderDate = Enums.Reminder.GetDate ( Start, Reminder );
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load
		or DeletionMark ) then
		return;
	endif; 
	if ( notifyResponsible () ) then
		TasksReminder.Write ( ThisObject );
	endif; 
	
EndProcedure

Function notifyResponsible ()
	
	remind = Reminder <> Enums.Reminder.None
	and Status = Enums.EventStatuses.Scheduled;
	return remind and Start > PeriodsSrv.CurrentUserDate ( Responsible );
	
EndFunction

#endif
